; domain
;; Alexander Shleyfman (shleyfman.alexander@gmail.com) and Ryo Kuroiwa (mhgeoe@gmail.com)
(define (domain mailrun)
    (:types
        hamlet scroll satchel courier - object
    )
    (:predicates
        (posted-at ?b - courier ?x - hamlet)
        (resting ?i - scroll ?x - hamlet)
        (road ?x - hamlet ?y - hamlet)
        (idle ?a - satchel)
        (held-in ?i - scroll ?a - satchel)
        (stowed-in ?i - scroll ?b - courier)
        (attached ?a - satchel ?b - courier)
    )

    (:functions
        (pouch_limit ?b - courier)
        (current_pouch ?b - courier)
        (mass ?i - scroll)
        (toll)
    )

    (:action ride
        :parameters (?b - courier ?x - hamlet ?y - hamlet)
        :precondition (and (posted-at ?b ?x)
            (road ?x ?y))
        :effect (and (posted-at ?b ?y)
            (not (posted-at ?b ?x))
            (increase (toll) 3)
        )
    )

    (:action grab
        :parameters (?i - scroll ?x - hamlet ?a - satchel ?b - courier)
        :precondition (and (resting ?i ?x) (posted-at ?b ?x) (idle ?a) (attached ?a ?b)
            (<= (+ (current_pouch ?b) (mass ?i)) (pouch_limit ?b)))
        :effect (and (held-in ?i ?a)
            (not (resting ?i ?x))
            (not (idle ?a))
            (increase (current_pouch ?b) (mass ?i))
            (increase (toll) 2)
        )
    )

    (:action place
        :parameters (?i - scroll ?x - hamlet ?a - satchel ?b - courier)
        :precondition (and (held-in ?i ?a)
            (posted-at ?b ?x)
            (attached ?a ?b))
        :effect (and (idle ?a)
            (resting ?i ?x)
            (not (held-in ?i ?a))
            (decrease (current_pouch ?b) (mass ?i))
            (increase (toll) 2)
        )
    )

    (:action to-pouch
        :parameters (?i - scroll ?a - satchel ?b - courier)
        :precondition (and (held-in ?i ?a)
            (attached ?a ?b))
        :effect (and (idle ?a)
            (not (held-in ?i ?a))
            (stowed-in ?i ?b)
            (increase (toll) 1)
        )
    )

    (:action from-pouch
        :parameters (?i - scroll ?a - satchel ?b - courier)
        :precondition (and (stowed-in ?i ?b)
            (attached ?a ?b)
            (idle ?a))
        :effect (and (not (idle ?a))
            (held-in ?i ?a)
            (not (stowed-in ?i ?b))
            (increase (toll) 1)
        )
    )
)

; problem
(define (problem delivery-x-4)
   (:domain mailrun)
   (:objects hamleta hamletb hamletc hamletd - hamlet
             scroll12 scroll11 scroll10
             scroll9 scroll8 scroll7 scroll6 scroll5 scroll4 scroll3 scroll2 scroll1 - scroll
             courier1 courier2 - courier
             leftstrap1 rightstrap1 leftstrap2 rightstrap2 - satchel)
   (:init (= (mass scroll10) 2)
          (= (mass scroll9) 2)
          (= (mass scroll8) 1)
          (= (mass scroll7) 1)
          (= (mass scroll6) 1)
          (= (mass scroll5) 1)
          (= (mass scroll4) 1)
          (= (mass scroll3) 1)
          (= (mass scroll2) 1)
          (= (mass scroll1) 1)
          (resting scroll10 hamleta)
          (resting scroll9 hamleta)
          (resting scroll8 hamleta)
          (resting scroll7 hamleta)
          (resting scroll6 hamleta)
          (resting scroll5 hamleta)
          (resting scroll4 hamleta)
          (resting scroll3 hamleta)
          (resting scroll2 hamleta)
          (resting scroll1 hamleta)

          (posted-at courier1 hamleta)
          (posted-at courier2 hamleta)
          (idle leftstrap1)
          (idle rightstrap1)
          (idle leftstrap2)
          (idle rightstrap2)
          (attached leftstrap1 courier1)
          (attached rightstrap1 courier1)
          (attached leftstrap2 courier2)
          (attached rightstrap2 courier2)

          (road hamleta hamletb)
          (road hamletb hamleta)
          (road hamletd hamletb)
          (road hamletb hamletd)
          (road hamleta hamletc)
          (road hamletc hamleta)

          (= (current_pouch courier1) 0)
          (= (pouch_limit courier1) 4)
          (= (current_pouch courier2) 0)
          (= (pouch_limit courier2) 4)
          (= (toll) 0))

   (:goal (and (resting scroll10 hamletb)
               (resting scroll9 hamletb)
               (resting scroll8 hamletd)
               (resting scroll7 hamletd)
               (resting scroll6 hamletd)
               (resting scroll5 hamletd)
               (resting scroll4 hamletc)
               (resting scroll3 hamletc)
               (resting scroll2 hamletc)
               (resting scroll1 hamletc)))

               (:metric minimize (toll))

)

; plan
1. (grab scroll5 hamleta leftstrap2 courier2)
   deleted: (resting scroll5 hamleta) (idle leftstrap2)
   added: (held-in scroll5 leftstrap2)
   changed: (current_pouch courier2) from 0 to 1, (toll) from 0 to 2
   goals met: 0 of 10
2. (ride courier2 hamleta hamletb)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletb)
   changed: (toll) from 2 to 5
   goals met: 0 of 10
3. (ride courier2 hamletb hamletd)
   deleted: (posted-at courier2 hamletb)
   added: (posted-at courier2 hamletd)
   changed: (toll) from 5 to 8
   goals met: 0 of 10
4. (grab scroll6 hamleta leftstrap1 courier1)
   deleted: (resting scroll6 hamleta) (idle leftstrap1)
   added: (held-in scroll6 leftstrap1)
   changed: (current_pouch courier1) from 0 to 1, (toll) from 8 to 10
   goals met: 0 of 10
5. (place scroll5 hamletd leftstrap2 courier2)
   deleted: (held-in scroll5 leftstrap2)
   added: (idle leftstrap2) (resting scroll5 hamletd)
   changed: (current_pouch courier2) from 1 to 0, (toll) from 10 to 12
   goals met: 1 of 10
6. (ride courier2 hamletd hamletb)
   deleted: (posted-at courier2 hamletd)
   added: (posted-at courier2 hamletb)
   changed: (toll) from 12 to 15
   goals met: 1 of 10
7. (ride courier2 hamletb hamleta)
   deleted: (posted-at courier2 hamletb)
   added: (posted-at courier2 hamleta)
   changed: (toll) from 15 to 18
   goals met: 1 of 10
8. (ride courier1 hamleta hamletb)
   deleted: (posted-at courier1 hamleta)
   added: (posted-at courier1 hamletb)
   changed: (toll) from 18 to 21
   goals met: 1 of 10
9. (ride courier1 hamletb hamletd)
   deleted: (posted-at courier1 hamletb)
   added: (posted-at courier1 hamletd)
   changed: (toll) from 21 to 24
   goals met: 1 of 10
10. (grab scroll4 hamleta leftstrap2 courier2)
   deleted: (resting scroll4 hamleta) (idle leftstrap2)
   added: (held-in scroll4 leftstrap2)
   changed: (current_pouch courier2) from 0 to 1, (toll) from 24 to 26
   goals met: 1 of 10
11. (place scroll6 hamletd leftstrap1 courier1)
   deleted: (held-in scroll6 leftstrap1)
   added: (idle leftstrap1) (resting scroll6 hamletd)
   changed: (current_pouch courier1) from 1 to 0, (toll) from 26 to 28
   goals met: 2 of 10
12. (ride courier1 hamletd hamletb)
   deleted: (posted-at courier1 hamletd)
   added: (posted-at courier1 hamletb)
   changed: (toll) from 28 to 31
   goals met: 2 of 10
13. (ride courier2 hamleta hamletc)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletc)
   changed: (toll) from 31 to 34
   goals met: 2 of 10
14. (place scroll4 hamletc leftstrap2 courier2)
   deleted: (held-in scroll4 leftstrap2)
   added: (idle leftstrap2) (resting scroll4 hamletc)
   changed: (current_pouch courier2) from 1 to 0, (toll) from 34 to 36
   goals met: 3 of 10
15. (ride courier2 hamletc hamleta)
   deleted: (posted-at courier2 hamletc)
   added: (posted-at courier2 hamleta)
   changed: (toll) from 36 to 39
   goals met: 3 of 10
16. (grab scroll3 hamleta leftstrap2 courier2)
   deleted: (resting scroll3 hamleta) (idle leftstrap2)
   added: (held-in scroll3 leftstrap2)
   changed: (current_pouch courier2) from 0 to 1, (toll) from 39 to 41
   goals met: 3 of 10
17. (ride courier2 hamleta hamletc)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletc)
   changed: (toll) from 41 to 44
   goals met: 3 of 10
18. (place scroll3 hamletc leftstrap2 courier2)
   deleted: (held-in scroll3 leftstrap2)
   added: (idle leftstrap2) (resting scroll3 hamletc)
   changed: (current_pouch courier2) from 1 to 0, (toll) from 44 to 46
   goals met: 4 of 10
19. (ride courier2 hamletc hamleta)
   deleted: (posted-at courier2 hamletc)
   added: (posted-at courier2 hamleta)
   changed: (toll) from 46 to 49
   goals met: 4 of 10
20. (grab scroll7 hamleta rightstrap2 courier2)
   deleted: (resting scroll7 hamleta) (idle rightstrap2)
   added: (held-in scroll7 rightstrap2)
   changed: (current_pouch courier2) from 0 to 1, (toll) from 49 to 51
   goals met: 4 of 10
21. (grab scroll2 hamleta leftstrap2 courier2)
   deleted: (resting scroll2 hamleta) (idle leftstrap2)
   added: (held-in scroll2 leftstrap2)
   changed: (current_pouch courier2) from 1 to 2, (toll) from 51 to 53
   goals met: 4 of 10
22. (ride courier1 hamletb hamleta)
   deleted: (posted-at courier1 hamletb)
   added: (posted-at courier1 hamleta)
   changed: (toll) from 53 to 56
   goals met: 4 of 10
23. (grab scroll8 hamleta rightstrap1 courier1)
   deleted: (resting scroll8 hamleta) (idle rightstrap1)
   added: (held-in scroll8 rightstrap1)
   changed: (current_pouch courier1) from 0 to 1, (toll) from 56 to 58
   goals met: 4 of 10
24. (ride courier1 hamleta hamletb)
   deleted: (posted-at courier1 hamleta)
   added: (posted-at courier1 hamletb)
   changed: (toll) from 58 to 61
   goals met: 4 of 10
25. (ride courier1 hamletb hamletd)
   deleted: (posted-at courier1 hamletb)
   added: (posted-at courier1 hamletd)
   changed: (toll) from 61 to 64
   goals met: 4 of 10
26. (to-pouch scroll2 leftstrap2 courier2)
   deleted: (held-in scroll2 leftstrap2)
   added: (idle leftstrap2) (stowed-in scroll2 courier2)
   changed: (toll) from 64 to 65
   goals met: 4 of 10
27. (place scroll8 hamletd rightstrap1 courier1)
   deleted: (held-in scroll8 rightstrap1)
   added: (idle rightstrap1) (resting scroll8 hamletd)
   changed: (current_pouch courier1) from 1 to 0, (toll) from 65 to 67
   goals met: 5 of 10
28. (ride courier1 hamletd hamletb)
   deleted: (posted-at courier1 hamletd)
   added: (posted-at courier1 hamletb)
   changed: (toll) from 67 to 70
   goals met: 5 of 10
29. (grab scroll1 hamleta leftstrap2 courier2)
   deleted: (resting scroll1 hamleta) (idle leftstrap2)
   added: (held-in scroll1 leftstrap2)
   changed: (current_pouch courier2) from 2 to 3, (toll) from 70 to 72
   goals met: 5 of 10
30. (ride courier2 hamleta hamletc)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletc)
   changed: (toll) from 72 to 75
   goals met: 5 of 10
31. (place scroll1 hamletc leftstrap2 courier2)
   deleted: (held-in scroll1 leftstrap2)
   added: (idle leftstrap2) (resting scroll1 hamletc)
   changed: (current_pouch courier2) from 3 to 2, (toll) from 75 to 77
   goals met: 6 of 10
32. (from-pouch scroll2 leftstrap2 courier2)
   deleted: (idle leftstrap2) (stowed-in scroll2 courier2)
   added: (held-in scroll2 leftstrap2)
   changed: (toll) from 77 to 78
   goals met: 6 of 10
33. (place scroll2 hamletc leftstrap2 courier2)
   deleted: (held-in scroll2 leftstrap2)
   added: (idle leftstrap2) (resting scroll2 hamletc)
   changed: (current_pouch courier2) from 2 to 1, (toll) from 78 to 80
   goals met: 7 of 10
34. (ride courier2 hamletc hamleta)
   deleted: (posted-at courier2 hamletc)
   added: (posted-at courier2 hamleta)
   changed: (toll) from 80 to 83
   goals met: 7 of 10
35. (ride courier2 hamleta hamletb)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletb)
   changed: (toll) from 83 to 86
   goals met: 7 of 10
36. (ride courier2 hamletb hamletd)
   deleted: (posted-at courier2 hamletb)
   added: (posted-at courier2 hamletd)
   changed: (toll) from 86 to 89
   goals met: 7 of 10
37. (place scroll7 hamletd rightstrap2 courier2)
   deleted: (held-in scroll7 rightstrap2)
   added: (idle rightstrap2) (resting scroll7 hamletd)
   changed: (current_pouch courier2) from 1 to 0, (toll) from 89 to 91
   goals met: 8 of 10
38. (ride courier1 hamletb hamleta)
   deleted: (posted-at courier1 hamletb)
   added: (posted-at courier1 hamleta)
   changed: (toll) from 91 to 94
   goals met: 8 of 10
39. (grab scroll9 hamleta rightstrap1 courier1)
   deleted: (resting scroll9 hamleta) (idle rightstrap1)
   added: (held-in scroll9 rightstrap1)
   changed: (current_pouch courier1) from 0 to 2, (toll) from 94 to 96
   goals met: 8 of 10
40. (ride courier1 hamleta hamletb)
   deleted: (posted-at courier1 hamleta)
   added: (posted-at courier1 hamletb)
   changed: (toll) from 96 to 99
   goals met: 8 of 10
41. (place scroll9 hamletb rightstrap1 courier1)
   deleted: (held-in scroll9 rightstrap1)
   added: (idle rightstrap1) (resting scroll9 hamletb)
   changed: (current_pouch courier1) from 2 to 0, (toll) from 99 to 101
   goals met: 9 of 10
42. (ride courier1 hamletb hamleta)
   deleted: (posted-at courier1 hamletb)
   added: (posted-at courier1 hamleta)
   changed: (toll) from 101 to 104
   goals met: 9 of 10
43. (grab scroll10 hamleta rightstrap1 courier1)
   deleted: (resting scroll10 hamleta) (idle rightstrap1)
   added: (held-in scroll10 rightstrap1)
   changed: (current_pouch courier1) from 0 to 2, (toll) from 104 to 106
   goals met: 9 of 10
44. (ride courier1 hamleta hamletb)
   deleted: (posted-at courier1 hamleta)
   added: (posted-at courier1 hamletb)
   changed: (toll) from 106 to 109
   goals met: 9 of 10
45. (place scroll10 hamletb rightstrap1 courier1)
   deleted: (held-in scroll10 rightstrap1)
   added: (idle rightstrap1) (resting scroll10 hamletb)
   changed: (current_pouch courier1) from 2 to 0, (toll) from 109 to 111
   goals met: 10 of 10
